particle-iot/device-os/hal/src/rtl872x/core_hal.c
}

void INT_HardFault_Patch(void)
{
    __ASM volatile(
        "MRS R0, MSP\n\t"
        "MRS R1, PSP\n\t"
        "MOV R2, LR\n\t" /* second parameter is LR current value */
        "MOV R3, #0\n\t"   
        "SUB.W    R4, R0, #128\n\t"
        "MSR MSP, R4\n\t"   // Move MSP to upper to for we can dump current stack contents without chage contents
        "LDR R4,=INT_HardFault_Patch_C\n\t"
        "BX R4\n\t"
    );
}

void INT_UsageFault_Patch(void)
{
    __ASM volatile(
        "MRS R0, MSP\n\t"
        "MRS R1, PSP\n\t"
        "MOV R2, LR\n\t" /* second parameter is LR current value */
        "MOV R3, #1\n\t"   
        "SUB.W    R4, R0, #128\n\t"
        "MSR MSP, R4\n\t"   // Move MSP to upper to for we can dump current stack contents without chage contents
        "LDR R4,=INT_HardFault_Patch_C\n\t"
        "BX R4\n\t"
    );
}

void INT_BusFault_Patch(void)
{
    __ASM volatile(
        "MRS R0, MSP\n\t"
        "MRS R1, PSP\n\t"
        "MOV R2, LR\n\t" /* second parameter is LR current value */
        "MOV R3, #2\n\t"   
        "SUB.W    R4, R0, #128\n\t"
        "MSR MSP, R4\n\t"   // Move MSP to upper to for we can dump current stack contents without chage contents
        "LDR R4,=INT_HardFault_Patch_C\n\t"
        "BX R4\n\t"
    );
}

void INT_MemFault_Patch(void)
{
    __ASM volatile(
        "MRS R0, MSP\n\t"
        "MRS R1, PSP\n\t"
        "MOV R2, LR\n\t" /* second parameter is LR current value */
        "MOV R3, #3\n\t"   
        "SUB.W    R4, R0, #128\n\t"
        "MSR MSP, R4\n\t"   // Move MSP to upper to for we can dump current stack contents without chage contents
        "LDR R4,=INT_HardFault_Patch_C\n\t"
        "BX R4\n\t"
    );
}

void SysTickOverride(void) {
    HAL_SysTick_Handler();
}

void SysTickChain() {
    SysTick_Handler();
    SysTickOverride();
}

/**
 * Called by HAL_Core_Init() to pre-initialize any low level hardware before
 * the main loop runs.
 */
void HAL_Core_Init_finalize(void) {
    // uint32_t* isrs = (uint32_t*)&link_ram_interrupt_vectors_location;
    // isrs[IRQN_TO_IDX(SysTick_IRQn)] = (uint32_t)SysTickChain;
    __NVIC_SetVector(SysTick_IRQn, (u32)(void*)SysTickChain);
}

void HAL_Core_Init(void) {
    HAL_Core_Init_finalize();
}

void HAL_Core_Config_systick_configuration(void) {
    // SysTick_Configuration();
    // sd_nvic_EnableIRQ(SysTick_IRQn);
    // dcd_migrate_data();
}

/**
 * Called by HAL_Core_Config() to allow the HAL implementation to override
 * the interrupt table if required.
 */
void HAL_Core_Setup_override_interrupts(void) {
    __NVIC_SetVector(SysTick_IRQn, (u32)(void*)SysTick_Handler);
    __NVIC_SetVector(SVCall_IRQn, (u32)(void*)SVC_Handler);
    __NVIC_SetVector(PendSV_IRQn, (u32)(void*)PendSV_Handler);

    __NVIC_SetVector(HardFault_IRQn, (u32)(void*)INT_HardFault_Patch);
    __NVIC_SetVector(MemoryManagement_IRQn, (u32)(void*)INT_MemFault_Patch);
    __NVIC_SetVector(BusFault_IRQn, (u32)(void*)INT_BusFault_Patch);
    __NVIC_SetVector(UsageFault_IRQn, (u32)(void*)INT_UsageFault_Patch);
}

void HAL_Core_Restore_Interrupt(IRQn_Type irqn) {
    // uint32_t handler = ((const uint32_t*)&link_interrupt_vectors_location)[IRQN_TO_IDX(irqn)];

    // // Special chain handler
    // if (irqn == SysTick_IRQn) {
    //     handler = (uint32_t)SysTickChain;
    // }

    // volatile uint32_t* isrs = (volatile uint32_t*)&link_ram_interrupt_vectors_location;
    // isrs[IRQN_TO_IDX(irqn)] = handler;
}

#if HAL_PLATFORM_PROHIBIT_XIP
static void prohibit_xip(void) {
    const uint8_t regions = (MPU->TYPE & MPU_TYPE_DREGION_Msk) >> MPU_TYPE_DREGION_Pos;
    // Disable MPU
    MPU->CTRL = 0;
    // Clear all regions
    for (uint8_t i = 0; i < regions; i++) {
        MPU->RNR    = i;
        MPU->RASR   = 0;
        MPU->RBAR   = 0;
    }

    uint8_t st = 0;
    sd_nvic_critical_region_enter(&st);

    // Forbid access to XIP
    MPU->RNR = 0;
    MPU->RBAR = EXTERNAL_FLASH_XIP_BASE;
    // XN: 1, instruction fetches disabled
    // AP: 0b000, all accesses generate a permission fault
    // TEX: 0b000, S: 0, C: 1, B: 0, as suggested by core manual for flash memory
    const uint32_t attr = 0x10050000;
    MPU->RASR = attr | (1 << MPU_RASR_ENABLE_Pos) | ((31 - __CLZ(EXTERNAL_FLASH_XIP_LENGTH) - 1) << MPU_RASR_SIZE_Pos);
    // Enable MPU
    MPU->CTRL = 0x00000005;

    sd_nvic_critical_region_exit(st);

    // Use a DSB followed by an ISB instruction to ensure that the new MPU configuration is used by subsequent instructions. 
    __DSB();
    __ISB();

    // Uncomment the code bellow will trigger hardfault
    // uint8_t data = *((uint8_t*)(EXTERNAL_FLASH_XIP_BASE + EXTERNAL_FLASH_OTA_ADDRESS));
    // LOG(ERROR, "%d", data);
}
#endif // HAL_PLATFORM_PROHIBIT_XIP

void debug_print_vector() {
    #define NVIC_USER_IRQ_OFFSET 16

    // Should use NewVectorTable of which the address is 0x10001000
    uint32_t* vectors = (uint32_t*)SCB->VTOR;

    DiagPrintf("SCB->VTOR: 0x%08X\r\n", SCB->VTOR);
    DiagPrintf("Stack: 0x%08X\r\n", vectors[0]);
    DiagPrintf("Reset_Handler: 0x%08X\r\n", vectors[1]);

    for (int i = NonMaskableInt_IRQn_LP; i <= KM4_WAKE_EVENT_IRQ_LP; i++) {
        DiagPrintf("IRQ: %d, 0x%08X\r\n", i, vectors[(int32_t)i + NVIC_USER_IRQ_OFFSET]);
    }
}

/*******************************************************************************
 * Function Name  : HAL_Core_Config.
 * Description    : Called in startup routine, before calling C++ constructors.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
extern uint32_t DiagPrintf(const char *fmt, ...);
void HAL_Core_Config(void) {
    DiagPrintf("part1\r\n");
    // volatile uint32_t rtlContinue = 0;
    // while (!rtlContinue) {
    //     asm("NOP");
    // }
    irq_table_init(MSP_RAM_HP_NS);

    // debug_print_vector();

    DECLARE_SYS_HEALTH(ENTERED_SparkCoreConfig);

#ifdef DFU_BUILD_ENABLE
    USE_SYSTEM_FLAGS = 1;
#endif

    /* Forward interrupts */
    // memcpy(&link_ram_interrupt_vectors_location, &link_interrupt_vectors_location, (uintptr_t)&link_ram_interrupt_vectors_location_end-(uintptr_t)&link_ram_interrupt_vectors_location);
    // uint32_t* isrs = (uint32_t*)&link_ram_interrupt_vectors_location;
    // SCB->VTOR = (uint32_t)isrs;

#if HAL_PLATFORM_PROHIBIT_XIP
    prohibit_xip();
#endif
    
